cfd/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Eel robot CFD case -- snap the hull surface into the background mesh         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;     // enable later for a y+ wall-layer drag study

geometry
{
    cfd_hull.stl
    {
        type triSurfaceMesh;
        name body;
    }
}

castellatedMeshControls
{
    maxLocalCells       1000000;
    maxGlobalCells      4000000;
    minRefinementCells  10;
    nCellsBetweenLevels 3;
    maxLoadUnbalance    0.10;
    resolveFeatureAngle 30;
    allowFreeStandingZoneFaces true;

    features
    (
        { file "cfd_hull.eMesh"; level 4; }
    );

    refinementSurfaces
    {
        body { level (2 3); }
    }

    refinementRegions {}

    // a point in the fluid, upstream of the body (body starts at z=0)
    locationInMesh (0 0 -0.3);
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      30;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes   true;
    layers {}
    expansionRatio  1.2;
    finalLayerThickness 0.4;
    minThickness    0.1;
    nGrow           0;
    featureAngle    60;
    nRelaxIter      3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals  3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter      50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-15;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;
}

mergeTolerance 1e-6;

// ************************************************************************* //
