cfd/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| Eel robot CFD case -- water transport properties                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// kinematic viscosity of fresh water at ~20 C [m^2/s]
nu              [0 2 -1 0 0 0 0] 1e-06;

// ************************************************************************* //
