cfd/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| Eel robot CFD case -- velocity field (inlet 0.5 m/s along +Z)               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.5);

boundaryField
{
    inlet    { type fixedValue; value uniform (0 0 0.5); }
    outlet   { type inletOutlet; inletValue uniform (0 0 0); value uniform (0 0 0.5); }
    farfield { type slip; }
    body     { type noSlip; }
}

// ************************************************************************* //
