cfd/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| Eel robot CFD case -- turbulent viscosity (computed; wall function on body)  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet    { type calculated; value uniform 0; }
    outlet   { type calculated; value uniform 0; }
    farfield { type slip; }
    body     { type nutkWallFunction; value uniform 0; }
}

// ************************************************************************* //
