cfd/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| Eel robot CFD case -- specific dissipation rate                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    inlet    { type fixedValue; value uniform 1.0; }
    outlet   { type inletOutlet; inletValue uniform 1.0; value uniform 1.0; }
    farfield { type slip; }
    body     { type omegaWallFunction; value uniform 1.0; }
}

// ************************************************************************* //
